app/views/results/index.html.erb

    <td><%= result.patient_id %></td>
	<td><%= result.patient.first %> <%= result.patient.last %></td>
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 ORDER BY "patients"."id" ASC LIMIT 1  [["id", "100001"]]

	</div></td>
	<td><%= localize(result.created_at, :format => :long) %></td>
---
INSERT INTO "results" ("created_at", "decode", "encode", "patient_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 04 Jul 2013 22:17:34 UTC +00:00], ["decode", nil], ["encode", "fffsfsdf"], ["patient_id", "1"], ["updated_at", Thu, 04 Jul 2013 22:17:34 UTC +00:00]]