app/views/results/show.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 ORDER BY "patients"."id" ASC LIMIT 1  [["id", "100001"]]
---
  <b>Name:</b>
  <%= @result.patient.first %> <%= @result.patient.last %>