app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients"
---
  def indexedit
    @patients = Patient.all

INSERT INTO "patients" ("created_at", "first", "key", "last", "id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 23 Jun 2013 14:32:38 UTC +00:00], ["first", "Andreas"], ["key", "32-bit"], ["last", "Staubert"], ["id", "1"], ["updated_at", Sun, 23 Jun 2013 14:32:38 UTC +00:00]]
---
  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "patients" SET "test_data" = '1234567812345678', "first" = 'Peter', "updated_at" = '2013-06-30 21:17:59.490859' WHERE "patients"."id" = 1
---
  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "4712"]]
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 4712]]
---
  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy