app/controllers/results_controller.rb

SELECT "results".* FROM "results"
---
  def indexedit
    @results = Result.all

SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @result = Result.find(params[:id])

SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @result = Result.find(params[:id])

SELECT 1 AS one FROM "results" WHERE "results"."encode" = 'gfdgdfg' LIMIT 1
---
  def create
    resultexists = Result.exists?(:encode => params[:payload])

INSERT INTO "results" ("created_at", "decode", "encode", "idr", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 30 Jun 2013 21:55:49 UTC +00:00], ["decode", nil], ["encode", "dsdfdfdsf"], ["idr", "12345"], ["updated_at", Sun, 30 Jun 2013 21:55:49 UTC +00:00]]
---
        #format.html { redirect_to results_url }
        format.html { render action: "errord" }
        format.json { render json: @result.errors, status: :unprocessable_entity }
      elsif @result.save

SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "results" WHERE "results"."id" = ?  [["id", 1]]
---
  def destroy
    @result = Result.find(params[:id])
    @result.destroy